IOsonata/IOsonata/RISCV/Espressif/include/esp32xx_gpio.h
/**-------------------------------------------------------------------------
@file	esp32xx_gpio.h

@brief	ESP32 GPIO/IO_MUX definitions for the IOsonata RISC-V family.

Covers C3/C5/C6.  Provides three things:
  1. Raw register macros (ESP32_GPIO_*_REG32, ESP32_IOMUX_PAD_REG) that
     work uniformly across all supported chips.  Use these in driver
     code that must compile for any chip.
  2. Bitfield Pos/Msk definitions for the GPIO matrix and IO_MUX
     register fields.  C5 widened the matrix selector fields and
     therefore has different bit positions than C3/C6.
  3. A typed register overlay (ESP32_GPIO_Type, ESP32_IOMUX_Type) for
     the C3/C6 layout.  C5 has substantially different register
     offsets and is NOT supported through these structs -- C5 code
     must use the raw *_REG32 macros instead.


@author	Nguyen Hoan Hoang
@date	May 9, 2026

@license

MIT License

Copyright (c) 2026 I-SYST inc. All rights reserved.

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.

----------------------------------------------------------------------------*/
#ifndef __ESP32XX_GPIO_H__
#define __ESP32XX_GPIO_H__

#include <stdint.h>
#include <stddef.h>

#include "esp32xx.h"

/*---------------------------------------------------------------------------
 * Cross-chip fallback macros.
 *
 * The chip-specific header normally supplies these.  These fallbacks are
 * defensive in case the chip header is bypassed.
 *---------------------------------------------------------------------------*/
#ifndef ESP32_GPIO_BASE
#  if   defined(ESP32C3)
#    define ESP32_GPIO_BASE                 ESP32C3_GPIO_BASE
#  elif defined(ESP32C5)
#    define ESP32_GPIO_BASE                 ESP32C5_GPIO_BASE
#  elif defined(ESP32C6)
#    define ESP32_GPIO_BASE                 ESP32C6_GPIO_BASE
#  endif
#endif

#ifndef ESP32_IOMUX_BASE
#  if   defined(ESP32C3)
#    define ESP32_IOMUX_BASE                ESP32C3_IOMUX_BASE
#  elif defined(ESP32C5)
#    define ESP32_IOMUX_BASE                ESP32C5_IOMUX_BASE
#  elif defined(ESP32C6)
#    define ESP32_IOMUX_BASE                ESP32C6_IOMUX_BASE
#  endif
#endif

#ifndef ESP32_GPIO_PIN_COUNT
#  if   defined(ESP32C3)
#    define ESP32_GPIO_PIN_COUNT            ESP32C3_GPIO_PIN_COUNT
#  elif defined(ESP32C5)
#    define ESP32_GPIO_PIN_COUNT            ESP32C5_GPIO_PIN_COUNT
#  elif defined(ESP32C6)
#    define ESP32_GPIO_PIN_COUNT            ESP32C6_GPIO_PIN_COUNT
#  endif
#endif

#ifndef ESP32_GPIO_PIN_REG_COUNT
#  if   defined(ESP32C3)
#    define ESP32_GPIO_PIN_REG_COUNT        ESP32C3_GPIO_PIN_REG_COUNT
#  elif defined(ESP32C5)
#    define ESP32_GPIO_PIN_REG_COUNT        ESP32C5_GPIO_PIN_REG_COUNT
#  elif defined(ESP32C6)
#    define ESP32_GPIO_PIN_REG_COUNT        ESP32C6_GPIO_PIN_REG_COUNT
#  endif
#endif

#ifndef ESP32_GPIO_FUNC_IN_COUNT
#  if   defined(ESP32C3)
#    define ESP32_GPIO_FUNC_IN_COUNT        ESP32C3_GPIO_FUNC_IN_COUNT
#  elif defined(ESP32C5)
#    define ESP32_GPIO_FUNC_IN_COUNT        ESP32C5_GPIO_FUNC_IN_COUNT
#  elif defined(ESP32C6)
#    define ESP32_GPIO_FUNC_IN_COUNT        ESP32C6_GPIO_FUNC_IN_COUNT
#  endif
#endif

#ifndef ESP32_GPIO_FUNC_OUT_COUNT
#  if   defined(ESP32C3)
#    define ESP32_GPIO_FUNC_OUT_COUNT       ESP32C3_GPIO_FUNC_OUT_COUNT
#  elif defined(ESP32C5)
#    define ESP32_GPIO_FUNC_OUT_COUNT       ESP32C5_GPIO_FUNC_OUT_COUNT
#  elif defined(ESP32C6)
#    define ESP32_GPIO_FUNC_OUT_COUNT       ESP32C6_GPIO_FUNC_OUT_COUNT
#  endif
#endif

#ifndef ESP32_GPIO_FUNC_OUT_REG_COUNT
#  if   defined(ESP32C3)
#    define ESP32_GPIO_FUNC_OUT_REG_COUNT   ESP32C3_GPIO_FUNC_OUT_REG_COUNT
#  elif defined(ESP32C5)
#    define ESP32_GPIO_FUNC_OUT_REG_COUNT   ESP32C5_GPIO_FUNC_OUT_REG_COUNT
#  elif defined(ESP32C6)
#    define ESP32_GPIO_FUNC_OUT_REG_COUNT   ESP32C6_GPIO_FUNC_OUT_REG_COUNT
#  endif
#endif

/*---------------------------------------------------------------------------
 * GPIO matrix magic values.
 *
 * - SEL_GPIO is the FUNC_OUT_SEL value that drives a pad directly from
 *   GPIO_OUT/GPIO_ENABLE instead of routing a peripheral output through
 *   the matrix.  It equals the number of peripheral output signals.
 *
 * - CONST_HIGH / CONST_LOW are FUNC_IN_SEL values that feed a constant
 *   logic level into a peripheral input instead of a pad.
 *
 * Values verified against ESP-IDF v5.3 components/soc/<chip>/include
 * (gpio_pins.h for C3/C6, gpio_struct.h FUNC_IN_SEL field doc for C5).
 *---------------------------------------------------------------------------*/
#if defined(ESP32C5)
#  define ESP32_GPIO_FUNC_OUT_SEL_GPIO      256U
#  define ESP32_GPIO_FUNC_IN_CONST_HIGH     0x40U
#  define ESP32_GPIO_FUNC_IN_CONST_LOW      0x60U
#else
#  define ESP32_GPIO_FUNC_OUT_SEL_GPIO      128U
#  define ESP32_GPIO_FUNC_IN_CONST_HIGH     0x1EU
#  define ESP32_GPIO_FUNC_IN_CONST_LOW      0x1FU
#endif

/*---------------------------------------------------------------------------
 * GPIO_PINn.INT_TYPE selector values (common to C3/C5/C6).
 *---------------------------------------------------------------------------*/
#define ESP32_GPIO_INT_DISABLE              0U
#define ESP32_GPIO_INT_RISING_EDGE          1U
#define ESP32_GPIO_INT_FALLING_EDGE         2U
#define ESP32_GPIO_INT_ANY_EDGE             3U
#define ESP32_GPIO_INT_LOW_LEVEL            4U
#define ESP32_GPIO_INT_HIGH_LEVEL           5U

