IOsonata/IOsonata/RISCV/Espressif/include/esp32xx_gpio.h
/*---------------------------------------------------------------------------
 * GPIO_PINn.INT_ENA bit positions inside the 5-bit field.
 *---------------------------------------------------------------------------*/
#define ESP32_GPIO_PIN_INT_ENA_CPU          (1U << 0)   //!< Route to CPU level interrupt.
#define ESP32_GPIO_PIN_INT_ENA_NMI          (1U << 1)   //!< Route to CPU NMI line.

/*---------------------------------------------------------------------------
 * GPIO_PINn bit positions and masks (common to C3/C5/C6).
 *---------------------------------------------------------------------------*/
#define ESP32_GPIO_PIN_SYNC2_BYPASS_Pos     0U
#define ESP32_GPIO_PIN_SYNC2_BYPASS_Msk     (3UL << ESP32_GPIO_PIN_SYNC2_BYPASS_Pos)
#define ESP32_GPIO_PIN_PAD_DRIVER_Pos       2U
#define ESP32_GPIO_PIN_PAD_DRIVER_Msk       (1UL << ESP32_GPIO_PIN_PAD_DRIVER_Pos)
#define ESP32_GPIO_PIN_SYNC1_BYPASS_Pos     3U
#define ESP32_GPIO_PIN_SYNC1_BYPASS_Msk     (3UL << ESP32_GPIO_PIN_SYNC1_BYPASS_Pos)
#define ESP32_GPIO_PIN_INT_TYPE_Pos         7U
#define ESP32_GPIO_PIN_INT_TYPE_Msk         (7UL << ESP32_GPIO_PIN_INT_TYPE_Pos)
#define ESP32_GPIO_PIN_WAKEUP_ENABLE_Pos    10U
#define ESP32_GPIO_PIN_WAKEUP_ENABLE_Msk    (1UL << ESP32_GPIO_PIN_WAKEUP_ENABLE_Pos)
#define ESP32_GPIO_PIN_CONFIG_Pos           11U
#define ESP32_GPIO_PIN_CONFIG_Msk           (3UL << ESP32_GPIO_PIN_CONFIG_Pos)
#define ESP32_GPIO_PIN_INT_ENA_Pos          13U
#define ESP32_GPIO_PIN_INT_ENA_Msk          (0x1FUL << ESP32_GPIO_PIN_INT_ENA_Pos)
#define ESP32_GPIO_PIN_INT_ENA_CPU_Msk      (1UL << ESP32_GPIO_PIN_INT_ENA_Pos)
#define ESP32_GPIO_PIN_INT_ENA_NMI_Msk      (1UL << (ESP32_GPIO_PIN_INT_ENA_Pos + 1U))

/*---------------------------------------------------------------------------
 * GPIO_FUNCn_IN_SEL_CFG and GPIO_FUNCn_OUT_SEL_CFG bit positions and masks.
 *
 * C5 widened both selector fields:
 *   IN_SEL  : 5 bits on C3/C6, 7 bits on C5  (29..127 GPIO matrix sources)
 *   OUT_SEL : 8 bits on C3/C6, 9 bits on C5  (256..511 peripheral signals)
 *
 * Single chip-conditional block; no #undef dance.
 *---------------------------------------------------------------------------*/
#if defined(ESP32C5)
#  define ESP32_GPIO_FUNC_IN_SEL_Pos        0U
#  define ESP32_GPIO_FUNC_IN_SEL_Msk        (0x7FUL << ESP32_GPIO_FUNC_IN_SEL_Pos)
#  define ESP32_GPIO_FUNC_IN_INV_SEL_Pos    7U
#  define ESP32_GPIO_FUNC_IN_INV_SEL_Msk    (1UL << ESP32_GPIO_FUNC_IN_INV_SEL_Pos)
#  define ESP32_GPIO_SIG_IN_SEL_Pos         8U
#  define ESP32_GPIO_SIG_IN_SEL_Msk         (1UL << ESP32_GPIO_SIG_IN_SEL_Pos)

#  define ESP32_GPIO_FUNC_OUT_SEL_Pos       0U
#  define ESP32_GPIO_FUNC_OUT_SEL_Msk       (0x1FFUL << ESP32_GPIO_FUNC_OUT_SEL_Pos)
#  define ESP32_GPIO_FUNC_OUT_INV_SEL_Pos   9U
#  define ESP32_GPIO_FUNC_OUT_INV_SEL_Msk   (1UL << ESP32_GPIO_FUNC_OUT_INV_SEL_Pos)
#  define ESP32_GPIO_FUNC_OEN_SEL_Pos       10U
#  define ESP32_GPIO_FUNC_OEN_SEL_Msk       (1UL << ESP32_GPIO_FUNC_OEN_SEL_Pos)
#  define ESP32_GPIO_FUNC_OEN_INV_SEL_Pos   11U
#  define ESP32_GPIO_FUNC_OEN_INV_SEL_Msk   (1UL << ESP32_GPIO_FUNC_OEN_INV_SEL_Pos)
#else
#  define ESP32_GPIO_FUNC_IN_SEL_Pos        0U
#  define ESP32_GPIO_FUNC_IN_SEL_Msk        (0x1FUL << ESP32_GPIO_FUNC_IN_SEL_Pos)
#  define ESP32_GPIO_FUNC_IN_INV_SEL_Pos    5U
#  define ESP32_GPIO_FUNC_IN_INV_SEL_Msk    (1UL << ESP32_GPIO_FUNC_IN_INV_SEL_Pos)
#  define ESP32_GPIO_SIG_IN_SEL_Pos         6U
#  define ESP32_GPIO_SIG_IN_SEL_Msk         (1UL << ESP32_GPIO_SIG_IN_SEL_Pos)

#  define ESP32_GPIO_FUNC_OUT_SEL_Pos       0U
#  define ESP32_GPIO_FUNC_OUT_SEL_Msk       (0xFFUL << ESP32_GPIO_FUNC_OUT_SEL_Pos)
#  define ESP32_GPIO_FUNC_OUT_INV_SEL_Pos   8U
#  define ESP32_GPIO_FUNC_OUT_INV_SEL_Msk   (1UL << ESP32_GPIO_FUNC_OUT_INV_SEL_Pos)
#  define ESP32_GPIO_FUNC_OEN_SEL_Pos       9U
#  define ESP32_GPIO_FUNC_OEN_SEL_Msk       (1UL << ESP32_GPIO_FUNC_OEN_SEL_Pos)
#  define ESP32_GPIO_FUNC_OEN_INV_SEL_Pos   10U
#  define ESP32_GPIO_FUNC_OEN_INV_SEL_Msk   (1UL << ESP32_GPIO_FUNC_OEN_INV_SEL_Pos)
#endif

/*---------------------------------------------------------------------------
 * IO_MUX_GPIOn bit positions and masks (common to C3/C5/C6).
 *---------------------------------------------------------------------------*/
#define ESP32_IOMUX_MCU_OE_Pos              0U
#define ESP32_IOMUX_MCU_OE_Msk              (1UL << ESP32_IOMUX_MCU_OE_Pos)
#define ESP32_IOMUX_SLP_SEL_Pos             1U
#define ESP32_IOMUX_SLP_SEL_Msk             (1UL << ESP32_IOMUX_SLP_SEL_Pos)
#define ESP32_IOMUX_MCU_WPD_Pos             2U
#define ESP32_IOMUX_MCU_WPD_Msk             (1UL << ESP32_IOMUX_MCU_WPD_Pos)
#define ESP32_IOMUX_MCU_WPU_Pos             3U
#define ESP32_IOMUX_MCU_WPU_Msk             (1UL << ESP32_IOMUX_MCU_WPU_Pos)
#define ESP32_IOMUX_MCU_IE_Pos              4U
#define ESP32_IOMUX_MCU_IE_Msk              (1UL << ESP32_IOMUX_MCU_IE_Pos)
#define ESP32_IOMUX_MCU_DRV_Pos             5U
#define ESP32_IOMUX_MCU_DRV_Msk             (3UL << ESP32_IOMUX_MCU_DRV_Pos)
#define ESP32_IOMUX_FUN_WPD_Pos             7U
#define ESP32_IOMUX_FUN_WPD_Msk             (1UL << ESP32_IOMUX_FUN_WPD_Pos)
#define ESP32_IOMUX_FUN_WPU_Pos             8U
#define ESP32_IOMUX_FUN_WPU_Msk             (1UL << ESP32_IOMUX_FUN_WPU_Pos)
#define ESP32_IOMUX_FUN_IE_Pos              9U
#define ESP32_IOMUX_FUN_IE_Msk              (1UL << ESP32_IOMUX_FUN_IE_Pos)
#define ESP32_IOMUX_FUN_DRV_Pos             10U
#define ESP32_IOMUX_FUN_DRV_Msk             (3UL << ESP32_IOMUX_FUN_DRV_Pos)
#define ESP32_IOMUX_MCU_SEL_Pos             12U
#define ESP32_IOMUX_MCU_SEL_Msk             (7UL << ESP32_IOMUX_MCU_SEL_Pos)
#define ESP32_IOMUX_FILTER_EN_Pos           15U
#define ESP32_IOMUX_FILTER_EN_Msk           (1UL << ESP32_IOMUX_FILTER_EN_Pos)

// MCU_SEL value selecting "GPIO" function (i.e. routing through GPIO matrix).
#define ESP32_IOMUX_MCU_SEL_GPIO            (1UL << ESP32_IOMUX_MCU_SEL_Pos)

/*===========================================================================
 * Typed register overlay (C3/C6 only).
 *
 * C5 has substantially different register offsets and is intentionally
 * omitted -- C5 code must use the raw *_REG32 macros further down in
 * this file.  The static_asserts below verify that the C3/C6 layout
 * lines up with the hardware register map.
 *
 * Bitfield structures use named-union access for both whole-register
 * and per-field views.  The bitfield layouts are valid for C3 and C6;
 * the GPIO_PIN bitfield is also valid for C5 but C5 has different
 * FUNC_IN/OUT bitfield widths, which is one more reason this overlay
 * is gated to !ESP32C5.
 *===========================================================================*/
#if !defined(ESP32C5)

typedef struct __ESP32_GPIO_BT_SELECT_Bits {
    uint32_t BT_SEL              : 32;   //!< Bit-select register (chip-specific use).
} ESP32_GPIO_BT_SELECT_Bits;

typedef struct __ESP32_GPIO_BITMAP_Bits {
    uint32_t DATA                : ESP32_GPIO_PIN_COUNT;          //!< One bit per usable pad.
    uint32_t RESERVED            : (32U - ESP32_GPIO_PIN_COUNT);
} ESP32_GPIO_BITMAP_Bits;

typedef struct __ESP32_GPIO_STRAP_Bits {
    uint32_t STRAPPING           : 16;   //!< Strap-pin sample (chip-specific bit assignment).
    uint32_t RESERVED            : 16;
} ESP32_GPIO_STRAP_Bits;

