IOsonata/IOsonata/RISCV/Espressif/include/esp32xx_gpio.h
typedef struct __ESP32_GPIO_PIN_Bits {
    uint32_t SYNC2_BYPASS        : 2;    //!< Second-stage input synchronizer control.
    uint32_t PAD_DRIVER          : 1;    //!< 0: normal output, 1: open-drain output.
    uint32_t SYNC1_BYPASS        : 2;    //!< First-stage input synchronizer control.
    uint32_t RESERVED0           : 2;
    uint32_t INT_TYPE            : 3;    //!< ESP32_GPIO_INT_*.
    uint32_t WAKEUP_ENABLE       : 1;    //!< Wake CPU from light sleep on this GPIO.
    uint32_t CONFIG              : 2;    //!< Reserved R/W field.
    uint32_t INT_ENA             : 5;    //!< INT_ENA field; use ESP32_GPIO_PIN_INT_ENA_*.
    uint32_t RESERVED1           : 14;
} ESP32_GPIO_PIN_Bits;

typedef struct __ESP32_GPIO_FUNC_IN_Bits {
    uint32_t IN_SEL              : 5;    //!< Pad index, or CONST_HIGH/CONST_LOW.
    uint32_t IN_INV_SEL          : 1;    //!< 1: invert input.
    uint32_t SIG_IN_SEL          : 1;    //!< 1: route via matrix; 0: direct from IO_MUX.
    uint32_t RESERVED            : 25;
} ESP32_GPIO_FUNC_IN_Bits;

typedef struct __ESP32_GPIO_FUNC_OUT_Bits {
    uint32_t OUT_SEL             : 8;    //!< Peripheral signal index, or 128 = direct GPIO drive.
    uint32_t OUT_INV_SEL         : 1;    //!< 1: invert output.
    uint32_t OEN_SEL             : 1;    //!< 1: OE from GPIO_ENABLE; 0: from peripheral.
    uint32_t OEN_INV_SEL         : 1;    //!< 1: invert output-enable.
    uint32_t RESERVED            : 21;
} ESP32_GPIO_FUNC_OUT_Bits;

typedef struct __ESP32_GPIO_CLK_EN_Bits {
    uint32_t CLK_EN              : 1;    //!< 1: GPIO register clock free-running.
    uint32_t RESERVED            : 31;
} ESP32_GPIO_CLK_EN_Bits;

typedef struct __ESP32_GPIO_DATE_Bits {
    uint32_t DATE                : 28;
    uint32_t RESERVED            : 4;
} ESP32_GPIO_DATE_Bits;

/*---------------------------------------------------------------------------
 * GPIO matrix register block (C3/C6 layout).
 *
 * Offsets verified against ESP-IDF v5.3
 * components/soc/esp32c3/include/soc/gpio_reg.h and
 * components/soc/esp32c6/include/soc/gpio_reg.h.
 *
 * All field offsets are fixed; only the per-pad PIN[] and
 * FUNC_OUT_CFG[] array lengths grow with the chip's register-bank
 * count (PIN_REG_COUNT / FUNC_OUT_REG_COUNT).  Reserved gaps are
 * computed so the next named register lands at its hardware offset
 * regardless of the array length.
 *---------------------------------------------------------------------------*/
typedef struct __ESP32_GPIO_Reg {
    union {
        volatile uint32_t BT_SELECT;        //!< 0x000  Bit-select register.
        volatile ESP32_GPIO_BT_SELECT_Bits BT_SELECT_Bit;
    };
    union {
        volatile uint32_t OUT;              //!< 0x004  Output value latch.
        volatile ESP32_GPIO_BITMAP_Bits OUT_Bit;
    };
    union {
        volatile uint32_t OUT_W1TS;         //!< 0x008  Output W1TS.
        volatile ESP32_GPIO_BITMAP_Bits OUT_W1TS_Bit;
    };
    union {
        volatile uint32_t OUT_W1TC;         //!< 0x00C  Output W1TC.
        volatile ESP32_GPIO_BITMAP_Bits OUT_W1TC_Bit;
    };
    uint32_t RESERVED0[4];  // 0x010..0x01C reserved (room for OUT1).
    union {
        volatile uint32_t ENABLE;           //!< 0x020  Output-driver enable.
        volatile ESP32_GPIO_BITMAP_Bits ENABLE_Bit;
    };
    union {
        volatile uint32_t ENABLE_W1TS;      //!< 0x024  Enable W1TS.
        volatile ESP32_GPIO_BITMAP_Bits ENABLE_W1TS_Bit;
    };
    union {
        volatile uint32_t ENABLE_W1TC;      //!< 0x028  Enable W1TC.
        volatile ESP32_GPIO_BITMAP_Bits ENABLE_W1TC_Bit;
    };
    uint32_t RESERVED1[3];  // 0x02C..0x034 reserved.
    union {
        volatile uint32_t STRAPPING;        //!< 0x038  Strap-pin sampled values.
        volatile ESP32_GPIO_STRAP_Bits STRAPPING_Bit;
    };
    union {
        volatile uint32_t IN;               //!< 0x03C  Input value.
        volatile ESP32_GPIO_BITMAP_Bits IN_Bit;
    };
    uint32_t RESERVED2;  // 0x040 reserved (room for IN1).
    union {
        volatile uint32_t ISTATUS;          //!< 0x044  Interrupt status (per-pin).
        volatile ESP32_GPIO_BITMAP_Bits ISTATUS_Bit;
    };
    union {
        volatile uint32_t ISTATUS_W1TS;     //!< 0x048  Status W1TS.
        volatile ESP32_GPIO_BITMAP_Bits ISTATUS_W1TS_Bit;
    };
    union {
        volatile uint32_t ISTATUS_W1TC;     //!< 0x04C  Status W1TC.
        volatile ESP32_GPIO_BITMAP_Bits ISTATUS_W1TC_Bit;
    };
    uint32_t RESERVED3[3];  // 0x050..0x058 reserved.
    union {
        volatile uint32_t PROCPU_INT;       //!< 0x05C  CPU interrupt status.
        volatile ESP32_GPIO_BITMAP_Bits PROCPU_INT_Bit;
    };
    union {
        volatile uint32_t PCPU_NMI_INT;     //!< 0x060  CPU NMI status.
        volatile ESP32_GPIO_BITMAP_Bits PCPU_NMI_INT_Bit;
    };
    union {
        volatile uint32_t CPUSDIO_INT;      //!< 0x064  SDIO host CPU int status.
        volatile ESP32_GPIO_BITMAP_Bits CPUSDIO_INT_Bit;
    };
    uint32_t RESERVED4[3];  // 0x068..0x070 reserved (PCPU_INT1 on some chips).
    union {
        volatile uint32_t PIN[ESP32_GPIO_PIN_REG_COUNT];
                                            //!< 0x074  Per-pad sync/wake/PAD_DRIVER cfg.
        volatile ESP32_GPIO_PIN_Bits PIN_Bit[ESP32_GPIO_PIN_REG_COUNT];
    };
    uint32_t RESERVED5[(0x014CU - (0x0074U + (ESP32_GPIO_PIN_REG_COUNT * 4U))) / 4U];

    union {
        volatile uint32_t ISTATUS_NEXT;     //!< 0x14C  Edge-detect helper.
        volatile ESP32_GPIO_BITMAP_Bits ISTATUS_NEXT_Bit;
    };
    uint32_t RESERVED6;  // 0x150 reserved.
    union {
        volatile uint32_t FUNC_IN_CFG[ESP32_GPIO_FUNC_IN_COUNT];
                                            //!< 0x154  Peripheral-input routing.
        volatile ESP32_GPIO_FUNC_IN_Bits FUNC_IN_CFG_Bit[ESP32_GPIO_FUNC_IN_COUNT];
    };
    uint32_t RESERVED7[(0x0554U - (0x0154U + (ESP32_GPIO_FUNC_IN_COUNT * 4U))) / 4U];

    union {
        volatile uint32_t FUNC_OUT_CFG[ESP32_GPIO_FUNC_OUT_REG_COUNT];
                                            //!< 0x554  Per-pad output routing.
        volatile ESP32_GPIO_FUNC_OUT_Bits FUNC_OUT_CFG_Bit[ESP32_GPIO_FUNC_OUT_REG_COUNT];
    };
    uint32_t RESERVED8[(0x062CU - (0x0554U + (ESP32_GPIO_FUNC_OUT_REG_COUNT * 4U))) / 4U];

    union {
        volatile uint32_t CLK_EN;           //!< 0x62C  Clock-gate.
        volatile ESP32_GPIO_CLK_EN_Bits CLK_EN_Bit;
    };
    uint32_t RESERVED9[(0x06FCU - 0x0630U) / 4U];

    union {
        volatile uint32_t DATE;             //!< 0x6FC  Version/date register.
        volatile ESP32_GPIO_DATE_Bits DATE_Bit;
    };
} ESP32_GPIO_Type;

