IOsonata/IOsonata/RISCV/Espressif/include/esp32xx_gpio.h
/*---------------------------------------------------------------------------
 * IO_MUX register block (C3/C6 layout).
 *
 *   0x000          PIN_CTRL    Clock-output selection.
 *   0x004 + 4*n    GPIO[n]     IO_MUX_GPIOn pad configuration.
 *   0x0FC          DATE        IO_MUX version register.
 *
 * C5 IO_MUX has a different layout (no PIN_CTRL, GPIO[N] starts at
 * 0x000, DATE at 0x1FC) and is excluded from this overlay; C5 code
 * uses ESP32_IOMUX_PAD_REG(n) below.
 *---------------------------------------------------------------------------*/
typedef struct __ESP32_IOMUX_Reg {
    volatile uint32_t PIN_CTRL;             //!< 0x000  Clock-output configuration.
    volatile uint32_t GPIO[ESP32_GPIO_PIN_REG_COUNT];
                                            //!< 0x004  IO_MUX_GPIOn pad config.
    uint32_t RESERVED0[(0x00FCU - (0x0004U + (ESP32_GPIO_PIN_REG_COUNT * 4U))) / 4U];
    volatile uint32_t DATE;                 //!< 0x0FC  IO_MUX version register.
} ESP32_IOMUX_Type;

#define ESP32_GPIO                          ((ESP32_GPIO_Type  *)((uintptr_t)ESP32_GPIO_BASE))
#define ESP32_IOMUX                         ((ESP32_IOMUX_Type *)((uintptr_t)ESP32_IOMUX_BASE))

#define ESP32_STATIC_ASSERT(cond, name)     typedef char esp32_static_assert_##name[(cond) ? 1 : -1]

ESP32_STATIC_ASSERT(sizeof(ESP32_GPIO_BT_SELECT_Bits) == 4U, gpio_bt_select_bits_size);
ESP32_STATIC_ASSERT(sizeof(ESP32_GPIO_BITMAP_Bits)    == 4U, gpio_bitmap_bits_size);
ESP32_STATIC_ASSERT(sizeof(ESP32_GPIO_STRAP_Bits)     == 4U, gpio_strap_bits_size);
ESP32_STATIC_ASSERT(sizeof(ESP32_GPIO_PIN_Bits)       == 4U, gpio_pin_bits_size);
ESP32_STATIC_ASSERT(sizeof(ESP32_GPIO_FUNC_IN_Bits)   == 4U, gpio_func_in_bits_size);
ESP32_STATIC_ASSERT(sizeof(ESP32_GPIO_FUNC_OUT_Bits)  == 4U, gpio_func_out_bits_size);
ESP32_STATIC_ASSERT(sizeof(ESP32_GPIO_CLK_EN_Bits)    == 4U, gpio_clk_en_bits_size);
ESP32_STATIC_ASSERT(sizeof(ESP32_GPIO_DATE_Bits)      == 4U, gpio_date_bits_size);

ESP32_STATIC_ASSERT(offsetof(ESP32_GPIO_Type, OUT)            == 0x0004U, gpio_out_offset);
ESP32_STATIC_ASSERT(offsetof(ESP32_GPIO_Type, ENABLE)         == 0x0020U, gpio_enable_offset);
ESP32_STATIC_ASSERT(offsetof(ESP32_GPIO_Type, STRAPPING)      == 0x0038U, gpio_strapping_offset);
ESP32_STATIC_ASSERT(offsetof(ESP32_GPIO_Type, IN)             == 0x003CU, gpio_in_offset);
ESP32_STATIC_ASSERT(offsetof(ESP32_GPIO_Type, ISTATUS)        == 0x0044U, gpio_status_offset);
ESP32_STATIC_ASSERT(offsetof(ESP32_GPIO_Type, PROCPU_INT)     == 0x005CU, gpio_procpu_int_offset);
ESP32_STATIC_ASSERT(offsetof(ESP32_GPIO_Type, PCPU_NMI_INT)   == 0x0060U, gpio_pcpu_nmi_int_offset);
ESP32_STATIC_ASSERT(offsetof(ESP32_GPIO_Type, CPUSDIO_INT)    == 0x0064U, gpio_cpusdio_int_offset);
ESP32_STATIC_ASSERT(offsetof(ESP32_GPIO_Type, PIN)            == 0x0074U, gpio_pin_offset);
ESP32_STATIC_ASSERT(offsetof(ESP32_GPIO_Type, ISTATUS_NEXT)   == 0x014CU, gpio_status_next_offset);
ESP32_STATIC_ASSERT(offsetof(ESP32_GPIO_Type, FUNC_IN_CFG)    == 0x0154U, gpio_func_in_offset);
ESP32_STATIC_ASSERT(offsetof(ESP32_GPIO_Type, FUNC_OUT_CFG)   == 0x0554U, gpio_func_out_offset);
ESP32_STATIC_ASSERT(offsetof(ESP32_GPIO_Type, CLK_EN)         == 0x062CU, gpio_clk_en_offset);
ESP32_STATIC_ASSERT(offsetof(ESP32_GPIO_Type, DATE)           == 0x06FCU, gpio_date_offset);

ESP32_STATIC_ASSERT(offsetof(ESP32_IOMUX_Type, PIN_CTRL)      == 0x0000U, iomux_pin_ctrl_offset);
ESP32_STATIC_ASSERT(offsetof(ESP32_IOMUX_Type, GPIO)          == 0x0004U, iomux_gpio_offset);
ESP32_STATIC_ASSERT(offsetof(ESP32_IOMUX_Type, DATE)          == 0x00FCU, iomux_date_offset);

#endif // !defined(ESP32C5)

/*===========================================================================
 * Raw register-address macros (cross-chip).
 *
 * These work for C3, C5, and C6.  Driver code that must compile for
 * any chip in the family should use these instead of the typed
 * overlay above.
 *===========================================================================*/
#ifndef ESP32_REG32
#define ESP32_REG32(addr)                   (*(volatile uint32_t *)((uintptr_t)(addr)))
#endif

#define ESP32_GPIO_OUT_REG_OFFSET           0x004U
#define ESP32_GPIO_OUT_W1TS_OFFSET          0x008U
#define ESP32_GPIO_OUT_W1TC_OFFSET          0x00CU

#if defined(ESP32C5)
#  define ESP32_GPIO_ENABLE_REG_OFFSET      0x034U
#  define ESP32_GPIO_ENABLE_W1TS_OFFSET     0x038U
#  define ESP32_GPIO_ENABLE_W1TC_OFFSET     0x03CU
#  define ESP32_GPIO_IN_REG_OFFSET          0x064U
#  define ESP32_GPIO_STATUS_REG_OFFSET      0x074U
#  define ESP32_GPIO_STATUS_W1TS_OFFSET     0x078U
#  define ESP32_GPIO_STATUS_W1TC_OFFSET     0x07CU
#  define ESP32_GPIO_STATUS_NEXT_OFFSET     0x0C4U
#  define ESP32_GPIO_PIN0_REG_OFFSET        0x0D4U
#  define ESP32_GPIO_FUNC_IN0_REG_OFFSET    0x2D4U
#  define ESP32_GPIO_FUNC_OUT0_REG_OFFSET   0xAD4U
#  define ESP32_GPIO_CLOCK_GATE_OFFSET      0xDF8U
#  define ESP32_GPIO_DATE_OFFSET            0xDFCU
#  define ESP32_IOMUX_PAD0_REG_OFFSET       0x000U
#  define ESP32_IOMUX_DATE_OFFSET           0x1FCU
#else
#  define ESP32_GPIO_ENABLE_REG_OFFSET      0x020U
#  define ESP32_GPIO_ENABLE_W1TS_OFFSET     0x024U
#  define ESP32_GPIO_ENABLE_W1TC_OFFSET     0x028U
#  define ESP32_GPIO_IN_REG_OFFSET          0x03CU
#  define ESP32_GPIO_STATUS_REG_OFFSET      0x044U
#  define ESP32_GPIO_STATUS_W1TS_OFFSET     0x048U
#  define ESP32_GPIO_STATUS_W1TC_OFFSET     0x04CU
#  define ESP32_GPIO_STATUS_NEXT_OFFSET     0x14CU
#  define ESP32_GPIO_PIN0_REG_OFFSET        0x074U
#  define ESP32_GPIO_FUNC_IN0_REG_OFFSET    0x154U
#  define ESP32_GPIO_FUNC_OUT0_REG_OFFSET   0x554U
#  define ESP32_GPIO_CLOCK_GATE_OFFSET      0x62CU
#  define ESP32_GPIO_DATE_OFFSET            0x6FCU
#  define ESP32_IOMUX_PAD0_REG_OFFSET       0x004U
#  define ESP32_IOMUX_DATE_OFFSET           0x0FCU
#endif

#define ESP32_GPIO_OUT_REG32                ESP32_REG32(ESP32_GPIO_BASE  + ESP32_GPIO_OUT_REG_OFFSET)
#define ESP32_GPIO_OUT_W1TS_REG32           ESP32_REG32(ESP32_GPIO_BASE  + ESP32_GPIO_OUT_W1TS_OFFSET)
#define ESP32_GPIO_OUT_W1TC_REG32           ESP32_REG32(ESP32_GPIO_BASE  + ESP32_GPIO_OUT_W1TC_OFFSET)
#define ESP32_GPIO_ENABLE_REG32             ESP32_REG32(ESP32_GPIO_BASE  + ESP32_GPIO_ENABLE_REG_OFFSET)
#define ESP32_GPIO_ENABLE_W1TS_REG32        ESP32_REG32(ESP32_GPIO_BASE  + ESP32_GPIO_ENABLE_W1TS_OFFSET)
#define ESP32_GPIO_ENABLE_W1TC_REG32        ESP32_REG32(ESP32_GPIO_BASE  + ESP32_GPIO_ENABLE_W1TC_OFFSET)
#define ESP32_GPIO_IN_REG32                 ESP32_REG32(ESP32_GPIO_BASE  + ESP32_GPIO_IN_REG_OFFSET)
#define ESP32_GPIO_STATUS_REG32             ESP32_REG32(ESP32_GPIO_BASE  + ESP32_GPIO_STATUS_REG_OFFSET)
#define ESP32_GPIO_STATUS_W1TS_REG32        ESP32_REG32(ESP32_GPIO_BASE  + ESP32_GPIO_STATUS_W1TS_OFFSET)
#define ESP32_GPIO_STATUS_W1TC_REG32        ESP32_REG32(ESP32_GPIO_BASE  + ESP32_GPIO_STATUS_W1TC_OFFSET)
#define ESP32_GPIO_STATUS_NEXT_REG32        ESP32_REG32(ESP32_GPIO_BASE  + ESP32_GPIO_STATUS_NEXT_OFFSET)
#define ESP32_GPIO_PIN_REG32(pin)           ESP32_REG32(ESP32_GPIO_BASE  + ESP32_GPIO_PIN0_REG_OFFSET     + ((uint32_t)(pin) * 4U))
#define ESP32_GPIO_FUNC_IN_REG32(sig)       ESP32_REG32(ESP32_GPIO_BASE  + ESP32_GPIO_FUNC_IN0_REG_OFFSET + ((uint32_t)(sig) * 4U))
#define ESP32_GPIO_FUNC_OUT_REG32(pin)      ESP32_REG32(ESP32_GPIO_BASE  + ESP32_GPIO_FUNC_OUT0_REG_OFFSET + ((uint32_t)(pin) * 4U))
#define ESP32_GPIO_CLOCK_GATE_REG32         ESP32_REG32(ESP32_GPIO_BASE  + ESP32_GPIO_CLOCK_GATE_OFFSET)
#define ESP32_GPIO_DATE_REG32               ESP32_REG32(ESP32_GPIO_BASE  + ESP32_GPIO_DATE_OFFSET)

#define ESP32_IOMUX_PAD_REG(pin)            ESP32_REG32(ESP32_IOMUX_BASE + ESP32_IOMUX_PAD0_REG_OFFSET + ((uint32_t)(pin) * 4U))
#define ESP32_IOMUX_DATE_REG32              ESP32_REG32(ESP32_IOMUX_BASE + ESP32_IOMUX_DATE_OFFSET)

/*---------------------------------------------------------------------------
 * Composite value: program FUNC_OUT_CFG[pin] for "drive directly from
 * GPIO_OUT/GPIO_ENABLE" (i.e. simple GPIO output, no peripheral signal).
 *---------------------------------------------------------------------------*/
#define ESP32_GPIO_FUNC_OUT_GPIO_VALUE                                              \
    (((uint32_t)ESP32_GPIO_FUNC_OUT_SEL_GPIO << ESP32_GPIO_FUNC_OUT_SEL_Pos)        \
     | ESP32_GPIO_FUNC_OEN_SEL_Msk)

#endif // __ESP32XX_GPIO_H__
